<?php
    $tasksArray =
        [
            'Концепція PHP' =>
                [
                    'id' => 1,
                    'description' => 'Вивчення концептуальних понять пов\'язаних з мовою',
                    'owner' => 'Всі студенти курсу',
                    'status' => 'FI',
                ],
            'Вступ до PHP' =>
                [
                    'id' => 2,
                    'description' => 'Встановлення ПЗ необхідного для роботи з PHP',
                    'owner' => 'Всі студенти курсу',
                    'status' => 'FI',
                    'PHPStorm' =>
                        [
                            'id' => 1,
                            'description' => 'Для безпосереднього написання коду',
                            'owner' => 'Всі студенти курсу',
                            'status' => 'FI',
                        ],
                    'Docker' =>
                        [
                            'id' => 2,
                            'description' => 'Для створення локального середовища розробки',
                            'owner' => 'Всі студенти курсу',
                            'status' => 'FI',
                        ],
                    'GIT' =>
                        [
                            'id' => 3,
                            'description' => 'Для роботи в команді',
                            'owner' => 'Всі студенти курсу',
                            'status' => 'FI',
                        ],
                ],
            'Запис на курс Python' =>
                [
                    'id' => 3,
                    'description' => 'Прийти на вступне заняття, ознайомитися з синтаксисом, повернутися до мов з C-подібним синтаксисом',
                    'owner' => 'Всі студенти курсу',
                    'status' => '--',
                ],
            'Ознайомлення з базовими поняттями PHP' =>
                [
                    'id' => 4,
                    'description' => 'Типи даних, змінні, масиви, цикли...',
                    'owner' => 'Всі студенти курсу',
                    'status' => 'AC',
                    'Зробити огидний тернарник' =>
                        [
                            'id' => 1,
                            'description' => 'Навчитися робити так, як робити не треба',
                            'owner' => 'Всі студенти курсу',
                            'status' => 'FI',
                        ],
                    'Зробити масив з завданнями' =>
                        [
                            'id' => 2,
                            'description' => 'Увімкнути фантазію і уявити, що масив - база даних',
                            'owner' => 'Всі студенти курсу',
                            'status' => 'FI',
                        ],
                ],
            'Вивчення ООП' =>
                [
                    'id' => 5,
                    'description' => 'Поглиблені знання для більш широкого розуміння не лише PHP, а програмування взагалі',
                    'owner' => 'Всі студенти курсу',
                    'status' => 'OK',
                ],
        ];